---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotMakeSurface
source: html/a9936d4c-fba4-1704-de45-09c9d6901f61.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotMakeSurface Property

Can't construct surface.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeSurface { get; }
```